Thanks for testing @quixoticmonk. I've managed to reproduce the error, as well as your experience.

If you create a new routing profile without any `queue_configs`, it seems to work on first creation. The issue is then on any update to that profile, where it attempts to add an empty queue_configs block for some reason. I performed this test to come to these results:

1. Kept original config in place
2. Added an additional routing profile, with mostly the same config as the first (but a new name - `Temp Testing Profile`)
3. Applied the terraform

This resulted in the following plan and output:
Plan Output:
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.routing_profiles["SomeProfile"].awscc_connect_routing_profile.routing_profile will be updated in-place
  ~ resource "awscc_connect_routing_profile" "routing_profile" {
        id                         = "arn:aws:connect:ap-southeast-2:123456789012:instance/6621****-****-****-****-****a2b0e54/routing-profile/3a83****-****-****-****-****ba41acd5"
        name                       = "Some Profile"
      + queue_configs              = (known after apply)
      + tags                       = [
          + {
              + key   = "managed_by"
              + value = "terraform"
            },
        ]
        # (6 unchanged attributes hidden)
    }

  # module.routing_profiles["TempTestingProfile"].awscc_connect_routing_profile.routing_profile will be created
  + resource "awscc_connect_routing_profile" "routing_profile" {
      + agent_availability_timer   = "TIME_SINCE_LAST_ACTIVITY"
      + default_outbound_queue_arn = "arn:aws:connect:ap-southeast-2:123456789012:instance/6621****-****-****-****-****3a2b0e54/queue/c26c****-****-****-****-****3e6ebe03"
      + description                = "For testing functionality of terraform awscc provider"
      + id                         = (known after apply)
      + instance_arn               = "arn:aws:connect:ap-southeast-2:123456789012:instance/6621****-****-****-****-****3a2b0e54"
      + media_concurrencies        = [
          + {
              + channel                = "VOICE"
              + concurrency            = 1
              + cross_channel_behavior = {
                  + behavior_type = "ROUTE_CURRENT_CHANNEL_ONLY"
                }
            },
        ]
      + name                       = "Temp Testing Profile"
      + queue_configs              = (known after apply)
      + routing_profile_arn        = (known after apply)
      + tags                       = [
          + {
              + key   = "managed_by"
              + value = "terraform"
            },
        ]
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
Apply output:
````
module.routing_profiles["TempTestingProfile"].awscc_connect_routing_profile.routing_profile: Creating...
module.routing_profiles["SomeProfile"].awscc_connect_routing_profile.routing_profile: Modifying... [id=arn:aws:connect:ap-southeast-2:123456789012:instance/6621****-****-****-****-****a2b0e54/routing-profile/3a83****-****-****-****-****ba41acd5]
module.routing_profiles["TempTestingProfile"].awscc_connect_routing_profile.routing_profile: Creation complete after 5s [id=arn:aws:connect:ap-southeast-2:123456789012:instance/6621****-****-****-****-****3a2b0e54/routing-profile/91fd****-****-****-****-****411d4e65]
╷
│ Error: AWS SDK Go Service Operation Unsuccessful
│
│   with module.routing_profiles["SomeProfile"].awscc_connect_routing_profile.routing_profile,
│   on modules/routing-profiles/main.tf line 1, in resource "awscc_connect_routing_profile" "routing_profile":
│    1: resource "awscc_connect_routing_profile" "routing_profile" {
│
│ Calling Cloud Control API service UpdateResource operation returned: operation error CloudControl: UpdateResource, https response error StatusCode: 400, RequestID: c5fc76ae-0b5f-4fb5-a81a-bd3949f366b4, api error ValidationException: Model validation failed (#/QueueConfigs: expected minimum item count: 1, found: 0)
╵
```

As this shows, a freshly created routing profile will work fine, however the below update, where I've changed the name of the new profile to `Temp Testing Profile 2`, fails due to the original error.

Plan Output:
```
Terraform will perform the following actions:

  # module.routing_profiles["SomeProfile"].awscc_connect_routing_profile.routing_profile will be updated in-place
  ~ resource "awscc_connect_routing_profile" "routing_profile" {
        id                         = "arn:aws:connect:ap-southeast-2:123456789012:instance/6621****-****-****-****-****a2b0e54/routing-profile/3a83****-****-****-****-****ba41acd5"
        name                       = "Some Profile"
      + queue_configs              = (known after apply)
      + tags                       = [
          + {
              + key   = "managed_by"
              + value = "terraform"
            },
        ]
        # (6 unchanged attributes hidden)
    }

  # module.routing_profiles["TempTestingProfile"].awscc_connect_routing_profile.routing_profile will be updated in-place
  ~ resource "awscc_connect_routing_profile" "routing_profile" {
        id                         = "arn:aws:connect:ap-southeast-2:123456789012:instance/6621****-****-****-****-****a2b0e54/routing-profile/91fd****-****-****-****-****411d4e65"
      ~ name                       = "Temp Testing Profile" -> "Temp Testing Profile 2"
      + queue_configs              = (known after apply)
        tags                       = [
            {
                key   = "managed_by"
                value = "terraform"
            },
        ]
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

Apply Output:
```
module.routing_profiles["TempTestingProfile"].awscc_connect_routing_profile.routing_profile: Modifying... [id=arn:aws:connect:ap-southeast-2:123456789012:instance/6621****-****-****-****-****a2b0e54/routing-profile/91fd****-****-****-****-****411d4e65]
module.routing_profiles["SomeProfile"].awscc_connect_routing_profile.routing_profile: Modifying... [id=arn:aws:connect:ap-southeast-2:123456789012:instance/6621****-****-****-****-****a2b0e54/routing-profile/3a83****-****-****-****-****ba41acd5]
╷
│ Error: AWS SDK Go Service Operation Unsuccessful
│
│   with module.routing_profiles["SomeProfile"].awscc_connect_routing_profile.routing_profile,
│   on modules/routing-profiles/main.tf line 1, in resource "awscc_connect_routing_profile" "routing_profile":
│    1: resource "awscc_connect_routing_profile" "routing_profile" {
│
│ Calling Cloud Control API service UpdateResource operation returned: operation error CloudControl: UpdateResource, https response error StatusCode: 400, RequestID: 1ebd760f-c5ce-495e-ad03-2de5135616ee, api error ValidationException: Model validation failed (#/QueueConfigs: expected minimum item count: 1, found: 0)
╵
╷
│ Error: AWS SDK Go Service Operation Unsuccessful
│
│   with module.routing_profiles["TempTestingProfile"].awscc_connect_routing_profile.routing_profile,
│   on modules/routing-profiles/main.tf line 1, in resource "awscc_connect_routing_profile" "routing_profile":
│    1: resource "awscc_connect_routing_profile" "routing_profile" {
│
│ Calling Cloud Control API service UpdateResource operation returned: operation error CloudControl: UpdateResource, https response error StatusCode: 400, RequestID: 23846918-74c5-4da9-806d-5141432897cf, api error ValidationException: Model validation failed (#/QueueConfigs: expected minimum item count: 1, found: 0)
╵
```

I believe the original issue occurred because the "SomeProfile" routing profile was imported to the state from an existing profile that had no queue_configs. I realise now that I forgot to mention that detail in the original post, my apologies. Either way, the import to state was successful, and the subsequent plans only want to update the resource. 

I have also attempted to run an apply with
```terraform
 lifecycle {
    ignore_changes = [ queue_configs ]
  }
```

Added to the resource definition, however it appears to have no effect. This may be because it sees the "change" to the queue_configs attribute as being an initial creation of it, rather than a change to its state, though that sounds quite odd in itself.